import { Content } from "@/libs/components/content.text/content.text";
import Hero from "@/libs/components/hero/Hero";

const text = [
  {
    title: 'Доставка здійснюється за допомогою транспортної компанії «Нова Пошта» в будь-яке місто України.',

    description: [
      { text: 'Вартість доставки формується виходячи з габаритів, ваги, а також місця призначення і способу доставки.' },
      { text: 'Послуги компанії-перевізника з доставки замовлення Ви оплачуєте на місці, при його отриманні. Якщо товар бере участь в акції "Безкоштовна доставка", вартість доставки додатково не оплачується. ДЕТАЛІ І ПОВНИЙ ПЕРЕЛІК ТОВАРІВ, БЕРУТЬ УЧАСТЬ В АКЦІЇ "безкоштовного доставити", уточнювати У МЕНЕДЖЕРА! Безкоштовна доставка по Україні надається тільки компанією-перевізником Нова пошта на відділення перевізника.' },
      { text: `При отриманні товару необхідно мати при собі номер декларації і документ, що засвідчує особистість. На складі служби доставки обов'язково перевірте комплектацію товару, наявність зовнішніх пошкоджень упаковки і дефектів вироби.` },
      { text: 'Збірка товару не здійснюється.' },
      { text: 'Всі товари відправляються в оригінальних упаковках виробника.'}
    ],
  },
  {
    title: 'test',

    description: [
      { text: 'test' },
      { text: 'rrr' },
      { text: 'eee' },
      { text: 'ddd' },
    ],
  },
];



export default async function Home() {
  return (
    <>
      <Hero />
      {/* <About  /> */}
      <Content text={text} /> 
    </>
  );
}
