import { Content } from "@/libs/components/content.text/content.text";
import Hero from "@/libs/components/hero/Hero";
// import { text } from "express";

const text = [
  {
    title: 'Доставка та оплата',
    pre_title: 'Доставка здійснюється за допомогою транспортної компанії «Нова Пошта» в будь-яке місто України.',

    description: [
      { text: 'Вартість доставки формується виходячи з габаритів, ваги, а також місця призначення і способу доставки.' },
      { text: 'Послуги компанії-перевізника з доставки замовлення Ви оплачуєте на місці, при його отриманні. Якщо товар бере участь в акції "Безкоштовна доставка", вартість доставки додатково не оплачується. ДЕТАЛІ І ПОВНИЙ ПЕРЕЛІК ТОВАРІВ, БЕРУТЬ УЧАСТЬ В АКЦІЇ "безкоштовного доставити", уточнювати У МЕНЕДЖЕРА! Безкоштовна доставка по Україні надається тільки компанією-перевізником Нова пошта на відділення перевізника.' },
      { text: `При отриманні товару необхідно мати при собі номер декларації і документ, що засвідчує особистість. На складі служби доставки обов'язково перевірте комплектацію товару, наявність зовнішніх пошкоджень упаковки і дефектів вироби.` },
      { text: 'Збірка товару не здійснюється.' },
      { text: 'Всі товари відправляються в оригінальних упаковках виробника.'}
    ],
  },
  {
    pre_title: 'Способи оплати',

    description: [
      { text: 'Якщо ви оплачуєте покупку в відділенні Нової Пошти (накладений платіж) - необхідно буде додатково сплатити 20 гривень + 2% від суми замовлення. Це комісія Нової Пошти за переказ грошей від одержувача до відправника товару. При оформленні замовлення післяплатою ми беремо передоплату врозмірі рівній доставки в одну сторону, як гарантію того, що ви надійний покупець і віднімаємо цю суму при оформленні посилки. Всі витрати (комісія Нової пошти за зворотну доставку грошей в розмірі 2% від накладеного платежу + 20 грн), оплачуються покупцем при отриманні товару у відділенні Нової пошти. Мінімальна передплата великогабаритних товарів від 300 грн. Сума передоплати залежить від габаритів товару і вартості доставки. При отриманні накладений платіж зменшується на суму передоплати.' },
      { text: 'Безготівковий розрахунок. Додатково, при необхідності, оплачується комісія банку в розмірі 0,5%. Сума, зарахована на карту повинна дорівнювати сумі замовлення + 0,5%. Оплата карткою Visa, Mastercard - WayForPay' },
      { text: 'Миттєва розстрочка - ПриватБанк' },
      { text: 'Оплата частинами - ПриватБанку' },
      { text: 'Коли ми просимо Вас зробити передоплату за товар, ми лише хочемо застрахувати себе від ризиків. Крім того, перестрахувалися себе, ми можемо запропонувати Вам придбати товар за нижчою ціною. Як це працює, ми зараз пояснимо.' },
      { text: 'Часті вчинки покупців, які змусили нас прийняти рішення працювати за передоплатою:' },
      { text: '«Покупець привид» Покупець оформив замовлення, ми його відправили, а він просто не приходить забирати товар. У підсумку ми платимо за доставку товару покупцеві, за зберігання його на складі та за зворотну відправку нам (найпоширеніший випадок). «Я передумав купувати!» Покупцеві доставили товар, але він передумав його забирати. У підсумку ми втратили гроші на доставці і втратимо гроші на відправку товару назад.' },
      { text: '«Я подивився на машинку, там інший відтінок, не такий як на моніторі.» або «Одне колесо коляски темніше іншого" При отриманні товару покупець надумує собі "шлюб" і вимагає забрати товар. В результаті ми втрачаємо гроші на доставці до покупця і назад. «Ви знаєте, я знаю, що замовили синю коляску, а вчора подумали і вирішили, що хочемо зелену». Покупець, замовивши один товар просить замінити його на схожий з оплатою доставки нашим інтернет-магазином.' },
      { text: 'Інтернет-магазини, які працюють БЕЗ передоплати закладають ці ризики в ціну товару спочатку. А ті, що працюють з передоплатою, можуть продавати товар за нижчою ціною. Це означає, що витрати на доставку товару НЕ включені у вартість нашого товару, що дозволяє нам пропонувати Вам товару за нижчою ціною.' },
      { text: 'Чому Ви повинні нам повірити? Перш за все, наш інтернет-магазин «Enfys» - це сімейна компанія, яка суворо дотримується принципів діловодства та ділового етикету. (Швидше за все ці слова для Вас не матимуть будь-якої вага, але для нас ці слова дуже важливі). Відгуки про нашу роботу Ви можете прочитати на нашому сайті в розділі «Відгуки» ' },

    ],
  },
  {
    pre_title: 'Умови повернення та обміну',

    description: [
     { text: 'Компанія здійснює повернення та обмін цього товару відповідно до вимог законодавства.' },
     { text: 'Повернення можливе протягом 14 днів після отримання (для товарів належної якості). Зворотній доставка товарів здійснюється за рахунок покупця. Обмін і повернення товару можливий тільки в наступних випадках:' },
     { text: '• вам вислана зовсім інша модель;' },
     { text: '• колір моделі не відповідає фотографії (кардинально інший колір, відтінок не береться до уваги, так як різні монітори можуть по різному передавати один і той же колір)' },
     { text: 'Якщо замовлений вами товар прийшов з фабричним браком. Ваші дії, якщо таке сталося: 1) Звяжіться з нами на протязі 3-х робочих днів будь-яким зручним для Вас способом 2) Зробіть фото шлюбу / помилки та надішліть нам для рассмортенія Вашої заявки 3) після підтвердження Вам повідомлять дані куди вислати посилку.' },
     { text: 'У всіх інших випадках обмін і повернення товару не відбувається. Щоб уникнути помилок при виборі розміру одягу, зверніть увагу на правильність і точність вимірів своїх параметрів. Щоб правильно визначити свій розмір, ми рекомендуємо вам скористатися розмірної сіткою, яка опублікована на сайті. ЗВЕРНІТЬ УВАГУ! У разі, якщо ви повернули товар без фабричної упаковки або з її пошкодженням, а також товар без етикетки або з її деформацією, якщо товар має ознаки його використання або прання, або товар пошкоджений навмисне, якщо ви надішлете нам товар, який не підлягає поверненню, то даний товар відправляється вам назад, при цьому всі витрати за пересилку оплачуєте ви.' },
     { text: 'Оформляючи замовлення, ви автоматично погоджуєтеся з умовами роботи нашого магазину.' },
    ]
  }
];



export default async function Home() {
  return (
    <>
      <Hero />
      {/* <About  /> */}
      <Content text={text} /> 
    </>
  );
}
